Revit 2027 API
BuiltInFailures.GenericFailures Class
 Generic failures that may apply to any Revit Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.GenericFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class GenericFailures
Public NotInheritable Class GenericFailures
public ref class GenericFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type GenericFailures = class end
The BuiltInFailures.GenericFailures type exposes the following members.
Properties
Name | Description
ElementsInInvalidContext |  There are elements in the document that exist in a context they should not. These elements must be deleted to continue using this project or family.
Top
See Also
Reference
Autodesk.Revit.DB Namespace